app/Listeners/Accueil.php

insert into `visits` (`ip`, `created_at`) values ('::1', '2021-10-10 12:44:09')
---
    public function handle(AccueilEvent $event)
    {
        DB::table('visits')->insert([
            'ip' => request()->ip(),
            'created_at' => Carbon::now(),
        ]);